
function Людина(імʼя, вік) {
    this.імʼя = імʼя;
    this.вік = вік;
  }
  Людина.prototype.вивестиІнформацію = function () {
    console.log("Ім'я: " + this.імʼя);
    console.log("Вік: " + this.вік);
  };
  function Автомобіль(марка, модель, рік, номернийЗнак) {
    this.марка = марка;
    this.модель = модель;
    this.рік = рік;
    this.номернийЗнак = номернийЗнак;
    this.власник = null;
  }
  Автомобіль.prototype.присвоїтиВласника = function (власник) {
    if (власник.вік > 18) {
      this.власник = власник;
    } else {
      console.log("Власник повинен бути старше 18 років.");
    }
  };
  Автомобіль.prototype.вивестиІнформацію = function () {
    console.log("Марка: " + this.марка);
    console.log("Модель: " + this.модель);
    console.log("Рік: " + this.рік);
    console.log("Номерний знак: " + this.номернийЗнак);
    if (this.власник) {
      console.log("Інформація про власника:");
      this.власник.вивестиІнформацію();
    }
  };
  let людина1 = new Людина("Іван", 25);
  let людина2 = new Людина("Марія", 19);
  let людина3 = new Людина("Петро", 30);
  let автомобіль1 = new Автомобіль("Toyota", "Camry", 2015, "ВІ1234АВ");
  let автомобіль2 = new Автомобіль("BMW", "X5", 2018, "СА5678ВС");
  let автомобіль3 = new Автомобіль("Mercedes", "C-Class", 2020, "АН9876ЕН");
  автомобіль1.присвоїтиВласника(людина1);
  автомобіль2.присвоїтиВласника(людина2);
  автомобіль3.присвоїтиВласника(людина3);
  автомобіль1.вивестиІнформацію();
  автомобіль2.вивестиІнформацію();
  автомобіль3.вивестиІнформацію();